package cu.aotain.osmp.task.constant;

public enum ProvinceCode {
	BJ("110000"),	// 北京市
	TJ("120000"), // 天津市
	HBJ("130000"),	// 河北省
	SXJ("140000"),	// 山西省
	NMG("150000"),// 内蒙古自治区
	LN("210000"),	// 辽宁省
	JL("220000"),	// 吉林省
	HLJ("230000"),	// 黑龙江省
	SH("310000"),	// 上海市
	JS("320000"),	// 江苏省
	ZJ("330000"),	// 浙江省
	AH("340000"),	// 安徽省
	FJ("350000"),	// 福建省
	JX("360000"),	// 江西省
	SD("370000"),	// 山东省
	HNY("410000"),	// 河南省
	HBE("420000"),	// 湖北省
	HNX("430000"),	// 湖南省
	GD("440000"),	// 广东省
	GX("450000"),	// 广西壮族自治区
	HNQ("460000"),	// 海南省
	CQ("500000"),	// 重庆市
	SC("510000"),	// 四川省
	GZ("520000"),	// 贵州省
	YN("530000"),	// 云南省
	XZ("540000"),	// 西藏自治区
	SXQ("610000"),	// 陕西省
	GS("620000"),	// 甘肃省
	QH("630000"),	// 青海省
	NX("640000"),	// 宁夏回族自治区
	XJ("650000"),	// 新疆维吾尔自治区
	TW("710000"),	// 台湾省
	XG("810000"),	// 香港特别行政区
	AM("820000");	// 澳门特别行政区

	private String code;

	ProvinceCode(String code) {
		this.code = code;
	}

	public String getCode() {
		return code;
	}
}
